Revit 2026 API

# ConcreteConcreteBrightmode Property

---

The property labeled "Weathering" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteBrightmode { get; }
```
```vb
Public Shared ReadOnly Property ConcreteBrightmode As String
	Get
```
```cpp
public:
static property String^ ConcreteBrightmode {
	String^ get ();
}
```
```fsharp
static member ConcreteBrightmode : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteBrightmodeType".

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace